# AlphanumericRevisionSettings Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AlphanumericRevisionSettings Methods
AlphanumericRevisionSettings Class See Also
---
The AlphanumericRevisionSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSequence | Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Determines whether a specified AlphanumericRevisionSettings is the same as 'this'. |
| IsValid | Determines whether the AlphanumericRevisionSettings object is in a valid state. |
| SetSequence | Sets the sequence of strings to be used as numbers for revisions with the Alphanumeric RevisionNumberType. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace